app/Controllers/Admin.php

    private function renderAdminView($viewName, $data = [])
    {
        // Fetch Unread Messages for Notifications
        $messagesModel = new \App\Models\MessagesModel();
        $data['unread_messages'] = $messagesModel->where('is_read', 0)->orderBy('created_at', 'DESC')->limit(5)->findAll();
        $data['unread_count'] = $messagesModel->where('is_read', 0)->countAllResults();

        // Fetch Profile for header
        $profileModel = new \App\Models\UserProfileModel();
        $data['admin_profile'] = $profileModel->first();
---
SELECT *
FROM `messages`
WHERE `is_read` = 0
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `is_read` = 0
SELECT *
FROM `profile`
 LIMIT 1

    public function dashboard()
    {
        $skillsModel   = new \App\Models\SkillsModel();
        $projectsModel = new \App\Models\ProjectsModel();
        $profileModel  = new \App\Models\UserProfileModel();
        $messagesModel = new \App\Models\MessagesModel();

        $profile = $profileModel->first();

        $data = [
            'page_title'     => 'Dashboard',
            'active_menu'    => 'dashboard',
            'total_skills'   => $skillsModel->where('status', 1)->countAllResults(),
            'total_projects' => $projectsModel->where('status', 1)->countAllResults(),
            'total_views'    => $profile['total_views'] ?? 0,
            'last_login'     => session()->get('last_login'),
            'total_messages' => $messagesModel->countAllResults(),
        ];
---
SELECT *
FROM `profile`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `skills`
WHERE `status` = 1

    public function update_profile()
    {
        $model = new \App\Models\UserProfileModel();
        $profile = $model->first();
---
SELECT *
FROM `profile`
 LIMIT 1