app/Controllers/Home.php

    public function index()
    {
        $skillsModel  = new \App\Models\SkillsModel();
        $projectsModel = new \App\Models\ProjectsModel();
        $profileModel  = new \App\Models\UserProfileModel();
        $contactModel  = new \App\Models\ContactModel();

        // Increment page view counter (safe — column existence managed by migration)
        $profile = $profileModel->first();
        if ($profile) {
            $profileModel->update($profile['id'], [
                'total_views' => ($profile['total_views'] ?? 0) + 1
            ]);
        }

        $data = [
            'skills'       => $skillsModel->where('status', 1)->orderBy('category', 'ASC')->orderBy('display_order', 'ASC')->findAll(),
            'projects'     => $projectsModel->where('status', 1)->orderBy('created_at', 'DESC')->findAll(),
            'experience'   => (new \App\Models\ExperienceModel())->orderBy('is_current', 'DESC')->orderBy('start_date', 'DESC')->findAll(),
            'education'    => (new \App\Models\EducationModel())->orderBy('year_end', 'DESC')->findAll(),
            'services'     => (new \App\Models\ServicesModel())->orderBy('created_at', 'ASC')->findAll(),
            'testimonials' => (new \App\Models\TestimonialsModel())->orderBy('created_at', 'DESC')->findAll(),
            'seo'          => (new \App\Models\SeoModel())->first() ?? [],
            'profile'      => $profileModel->first() ?? [],
            'contact'      => $contactModel->first() ?? [],
            'features'     => (new \App\Models\FeatureSettingsModel())->getFeaturesMap(),
            'theme'        => (new \App\Models\ThemeSettingsModel())->getActiveTheme(),
        ];
---
SELECT *
FROM `profile`
 LIMIT 1
UPDATE `profile` SET `total_views` = 14, `updated_at` = '2026-02-10 12:16:29'
WHERE `profile`.`id` IN ('1')
SELECT *
FROM `skills`
WHERE `status` = 1
ORDER BY `category` ASC, `display_order` ASC
SELECT *
FROM `projects`
WHERE `status` = 1
ORDER BY `created_at` DESC